#+TITLE: September 24, 2018 - October 9, 2018 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                           | WAITING | DONE                                                         | CANCELED |
|------+------+---------------------------------------+---------+--------------------------------------------------------------+----------|
|      |      | . [#A] Computer Network by Kruose & R |         | READ.1537984768. Learning Golang Chapter 6. Met (2018-10-11) |          |
|      |      | . [[https://tutorial.djangogirls      |         | DEV.1537984318. Learning Golang Chapter 5 Exer (2018-10-04)  |          |
|      |      | . Python Tutorials                    |         | READ.1537984603. Learning Golang Chapter 5. Fun (2018-10-03) |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------+------+-----------+--------------+------------|
| Homuncculus   |      34.0 |   8.01 |    0 |      34.0 |   2018-11-05 | ---------- |
| Bhavin192     |      7.32 |   7.16 | 7.32 |         0 |   2018-10-11 | ########## |
| Jasonbraganza |         0 |      0 |    0 |         0 |   2018-10-11 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE |            ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+-------------------+-------+-----------------|
|   1 | 2018-09-24 |             94.57 |    89 |                 |
|   2 | 2018-09-25 |             94.57 |    83 |                 |
|   3 | 2018-09-26 |             94.57 |    77 |                 |
|   4 | 2018-09-27 |             94.57 |    71 |                 |
|   5 | 2018-09-28 |             94.57 |    65 |                 |
|   6 | 2018-09-29 |             94.57 |    59 |                 |
|   7 | 2018-09-30 |             94.57 |    53 |                 |
|   8 | 2018-10-01 |             94.57 |    47 |                 |
|   9 | 2018-10-02 |             94.57 |    41 |                 |
|  10 | 2018-10-03 | 92.91999999999999 |    35 | READ.1537984603 |
|  11 | 2018-10-04 | 90.24999999999999 |    30 | DEV.1537984318  |
|  12 | 2018-10-05 | 90.24999999999999 |    24 |                 |
|  13 | 2018-10-06 | 90.24999999999999 |    18 |                 |
|  14 | 2018-10-07 | 90.24999999999999 |    12 |                 |
|  15 | 2018-10-08 | 90.24999999999999 |     6 |                 |
|  16 | 2018-10-09 | 90.24999999999999 |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                       | TASKID           | OWNER         | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| TASKS                                      |                  |               | B        |             |     94.57 |  15.17 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Maths                                      | READ.1537858093  | jasonbraganza | B        |             |        39 |        |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Improve to 30wpm using the Dvorak keyboard | WRITE.1537858335 | jasonbraganza | B        |             |      12.0 |        |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learn Emacs Org mode                       | READ.1537858579  | jasonbraganza | B        |             |      2.25 |        |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 5. Functions       | READ.1537984603  | bhavin192     | B        | DONE        |      1.65 |   1.12 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 5 Exercises        | DEV.1537984318   | bhavin192     | B        | DONE        |      2.67 |   3.67 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Learning Golang Chapter 6. Methods         | READ.1537984768  | bhavin192     | B        | DONE        |         3 |   2.37 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Computer Network by Kruose & Ross          |                  | homuncculus   | A        | IN_PROGRESS |      12.0 |   2.62 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| [[https://tutorial.djangogirls.org/en/][Django Girls Tutorial]]                      |                  | homuncculus   | B        | IN_PROGRESS |      15.0 |   5.22 |
|--------------------------------------------+------------------+---------------+----------+-------------+-----------+--------|
| Python Tutorials                           |                  | homuncculus   | B        | IN_PROGRESS |       7.0 |   0.17 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2018-09-24 Mon>
  :wpd-jasonbraganza: 3
  :wpd-bhavin192: 0.5
  :wpd-homuncculus: 2
  :END:
** Maths [0/13]
   :PROPERTIES:
   :ESTIMATED: 39
   :ACTUAL:
   :OWNER:    jasonbraganza
   :ID:       READ.1537858093
   :TASKID:   READ.1537858093
   :END:
   3h per day.
   - [ ] 2018-09-25 - Module-I: Sets, Relations and Functions - Sets 
   - [ ] 2018-09-26 - Module-I: Sets, Relations and Functions - Sets 
   - [ ] 2018-09-27 - Module-I: Sets, Relations and Functions - Relations and Functions-I 
   - [ ] 2018-09-28 - Module-I: Sets, Relations and Functions - Relations and Functions-I 
   - [ ] 2018-09-29 - Module-I: Sets, Relations and Functions - Trigonometric Functions-I 
   - [ ] 2018-10-01 - Module-I: Sets, Relations and Functions - Trigonometric Functions-I 
   - [ ] 2018-10-02 - Module-I: Sets, Relations and Functions - Trigonometric Functions-II 
   - [ ] 2018-10-03 - Module-I: Sets, Relations and Functions - Trigonometric Functions-II 
   - [ ] 2018-10-04 - Module-I: Sets, Relations and Functions - Relation between Sides and Angles of a Triangle 
   - [ ] 2018-10-05 - Module-I: Sets, Relations and Functions - Relation between Sides and Angles of a Triangle 
   - [ ] 2018-10-06 - Module -III: Algebra-I - Complex Numbers 
   - [ ] 2018-10-08 - Module -III: Algebra-I - Complex Numbers 
   - [ ] 2018-10-09 - Module -III: Algebra-I - Quadratic Equations and Linear Inequalities
** Improve to 30wpm using the Dvorak keyboard [0/15]
   :PROPERTIES:
   :ESTIMATED: 12.0
   :ACTUAL:
   :OWNER:    jasonbraganza
   :ID:       WRITE.1537858335
   :TASKID:   WRITE.1537858335
   :END:
   Learn the Dvorak keyboard (get upto 30 wpm across 2 sprints).
    Do the Dvorak typing & speed drills in Gtypist 45m daily.
   - [ ] 2018-09-24 - Lesson M1 - Practise 
   - [ ] 2018-09-25 - Lesson M2 - Practise 
   - [ ] 2018-09-26 - Lesson M3 - Practise 
   - [ ] 2018-09-27 - Lesson M4 - Practise 
   - [ ] 2018-09-28 - Lesson M5 - Practise 
   - [ ] 2018-09-29 - Lesson M6 - Practise 
   - [ ] 2018-09-30 - Lesson M7 - Practise 
   - [ ] 2018-10-01 - Lesson M8 - Practise 
   - [ ] 2018-10-02 - Lesson M9 - Practise 
   - [ ] 2018-10-03 - Lesson M10 - Practise 
   - [ ] 2018-10-04 - Lesson M11 - Practise 
   - [ ] 2018-10-05 - Lesson S1 - Speed Tests 
   - [ ] 2018-10-06 - Lesson S2 - Speed Tests 
   - [ ] 2018-10-08 - Lesson S3 - Speed Tests 
   - [ ] 2018-10-09 - Lesson S4 - Speed Tests 
** Learn Emacs Org mode [0/9]
   :PROPERTIES:
   :ESTIMATED: 2.25
   :ACTUAL:
   :OWNER: jasonbraganza
   :ID: READ.1537858579
   :TASKID: READ.1537858579
   :END:
   - [ ] 2018-09-25 - Go through the Org IRC session 
   - [ ] 2018-09-26 - Practice the Org mode commands 
   - [ ] 2018-09-27 - Practice the Org mode commands 
   - [ ] 2018-09-28 - Practice the Org mode commands 
   - [ ] 2018-09-29 - Practice the Org mode commands 
   - [ ] 2018-10-01 - Customize Emacs configuration for Org usage 
   - [ ] 2018-10-02 - Customize Emacs configuration for Org usage 
   - [ ] 2018-10-03 - Customize Emacs configuration for Org usage 
   - [ ] 2018-10-04 - Try to update OBM (and then figure out further steps with mbuf)
** DONE Learning Golang Chapter 5. Functions [4/4]
   CLOSED: [2018-10-03 Wed 23:22]
   :PROPERTIES:
   :ESTIMATED: 1.65
   :ACTUAL:   1.12
   :OWNER: bhavin192
   :ID: READ.1537984603
   :TASKID: READ.1537984603
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-03 Wed 23:11]--[2018-10-03 Wed 23:22] =>  0:11
   CLOCK: [2018-10-03 Wed 22:52]--[2018-10-03 Wed 23:10] =>  0:18
   CLOCK: [2018-10-01 Mon 18:35]--[2018-10-01 Mon 19:03] =>  0:28
   CLOCK: [2018-09-28 Fri 19:32]--[2018-09-28 Fri 19:42] =>  0:10
   :END:
   - [X] 5.7 Variadic Functions (10m)
   - [X] 5.8 Deferred Function calls (50m)
   - [X] 5.9 Panic (25m)
   - [X] 5.10 Recover (15m)
** DONE Learning Golang Chapter 5 Exercises [4/4]
   CLOSED: [2018-10-04 Thu 19:26]
   :PROPERTIES:
   :ESTIMATED: 2.67
   :ACTUAL:   3.67
   :OWNER: bhavin192
   :ID: DEV.1537984318
   :TASKID: DEV.1537984318
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-04 Thu 19:12]--[2018-10-04 Thu 19:26] =>  0:14
   CLOCK: [2018-10-01 Mon 19:17]--[2018-10-01 Mon 19:30] =>  0:13
   CLOCK: [2018-09-30 Sun 20:40]--[2018-09-30 Sun 21:22] =>  0:42
   CLOCK: [2018-09-28 Fri 20:12]--[2018-09-28 Fri 20:23] =>  0:11
   CLOCK: [2018-09-28 Fri 19:48]--[2018-09-28 Fri 20:06] =>  0:18
   CLOCK: [2018-09-27 Thu 19:29]--[2018-09-27 Thu 19:45] =>  0:16
   CLOCK: [2018-09-27 Thu 19:14]--[2018-09-27 Thu 19:23] =>  0:09
   CLOCK: [2018-09-26 Wed 21:26]--[2018-09-26 Wed 21:56] =>  0:30
   CLOCK: [2018-09-26 Wed 20:20]--[2018-09-26 Wed 20:44] =>  0:24
   CLOCK: [2018-09-25 Tue 19:32]--[2018-09-25 Tue 20:15] =>  0:43
   :END:
   - [X] 5.6 Part II (60m)
   - [X] 5.7 (70m)
   - [X] 5.8 (15m)
   - [X] 5.10 (15m)
** DONE Learning Golang Chapter 6. Methods [6/6]
   CLOSED: [2018-10-11 Thu 23:27]
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:   2.37
   :OWNER: bhavin192
   :ID: READ.1537984768
   :TASKID: READ.1537984768
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-09 Tue 23:10]--[2018-10-09 Tue 23:27] =>  0:17
   CLOCK: [2018-10-09 Tue 22:27]--[2018-10-09 Tue 23:00] =>  0:33
   CLOCK: [2018-10-08 Mon 22:47]--[2018-10-08 Mon 22:52] =>  0:05
   CLOCK: [2018-10-08 Mon 21:09]--[2018-10-08 Mon 21:24] =>  0:15
   CLOCK: [2018-10-08 Mon 20:54]--[2018-10-08 Mon 21:01] =>  0:07
   CLOCK: [2018-10-08 Mon 19:45]--[2018-10-08 Mon 19:54] =>  0:09
   CLOCK: [2018-10-08 Mon 19:10]--[2018-10-08 Mon 19:32] =>  0:22
   CLOCK: [2018-10-05 Fri 22:55]--[2018-10-05 Fri 23:04] =>  0:09
   CLOCK: [2018-10-05 Fri 22:29]--[2018-10-05 Fri 22:54] =>  0:25
   :END:
   - [X] 6.1 Method Declarations (30m)
   - [X] 6.2 Methods with a Pointer Receiver (50m)
   - [X] 6.3 Composing Types by Struct Embedding (30m)
   - [X] 6.4 Method Values and Expressions (20m)
   - [X] 6.5 Example: Bit Vector Type (30m)
   - [X] 6.6 Encapsulation (20m)
** IN_PROGRESS [#A] Computer Network by Kruose & Ross [1/4]            :read:
   :PROPERTIES:
   :ESTIMATED: 12.0
   :ACTUAL:   2.62
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-09-26 Wed 20:05]--[2018-09-26 Wed 20:19] =>  0:14
   CLOCK: [2018-09-26 Wed 19:10]--[2018-09-26 Wed 19:41] =>  0:31
   CLOCK: [2018-09-26 Wed 14:42]--[2018-09-26 Wed 15:00] =>  0:18
   CLOCK: [2018-09-26 Wed 13:47]--[2018-09-26 Wed 14:30] =>  0:43
   CLOCK: [2018-09-25 Tue 18:25]--[2018-09-25 Tue 18:53] =>  0:28
   CLOCK: [2018-09-25 Tue 17:40]--[2018-09-25 Tue 18:03] =>  0:23
   :END:
   - [X] Chapter 2. Application Layer
   - [ ] Practice Problems
   - [ ] Chapter 3. Transport Layer
   - [ ] Practice Problems
** IN_PROGRESS [[https://tutorial.djangogirls.org/en/][Django Girls Tutorial]] [83%]
   :PROPERTIES:
   :ESTIMATED: 15.0
   :ACTUAL:   5.22
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-01 Mon 12:52]--[2018-10-01 Mon 14:03] =>  1:11
   CLOCK: [2018-09-30 Sun 23:15]--[2018-10-01 Mon 00:13] =>  0:58
   CLOCK: [2018-09-30 Sun 20:42]--[2018-09-30 Sun 21:51] =>  1:09
   CLOCK: [2018-09-26 Wed 15:49]--[2018-09-26 Wed 16:46] =>  0:57
   CLOCK: [2018-09-25 Tue 19:32]--[2018-09-25 Tue 20:03] =>  0:31
   CLOCK: [2018-09-25 Tue 19:01]--[2018-09-25 Tue 19:28] =>  0:27
   :END:
    - [X] Installation
    - [X] Setup Emacs
    - [X] [[https://tutorial.djangogirls.org/en/django_start_project/][First Django Project]]
    - [X] [[https://tutorial.djangogirls.org/en/django_models/][Django Models]]
    - [X] [[https://tutorial.djangogirls.org/en/django_admin/][Django Admin]]
    - [ ] [[https://tutorial.djangogirls.org/en/deploy/][Deploy]]
** IN_PROGRESS Python Tutorials [0/5]                                  :code:
   :PROPERTIES:
   :ESTIMATED: 7.0
   :ACTUAL:   0.17
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-01 Mon 23:12]--[2018-10-01 Mon 23:16] =>  0:04
   CLOCK: [2018-10-01 Mon 22:49]--[2018-10-01 Mon 22:54] =>  0:05
   CLOCK: [2018-09-25 Tue 18:59]--[2018-09-25 Tue 19:00] =>  0:01
   :END:
   - [ ] [[https://docs.python.org/3/tutorial/errors.html][Errors & Exceptions]]
   - [ ] [[https://docs.python.org/3/tutorial/classes.html][Classes]]
   - [ ] [[https://docs.python.org/3/tutorial/stdlib.html][Brief tour of standard library - I]]
   - [ ] [[https://docs.python.org/3/tutorial/stdlib2.html][Brief tour of standard library - II]]
   - [ ] [[https://docs.python.org/3/tutorial/venv.html][Virtual environments & packages]]
